## cleaning data

In [1]:
import numpy as np
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

In [14]:
url = "https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv"
data = pd.read_csv(url)
data

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          n/a        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

figure out what your features and their expected types are

features:
- street number -- int
- street name -- string
- owner occupied  -- string
- number of bedrooms -- int
- number of bathrooms -- float
- area -- int

In [8]:
print(data['ST_NUM'])
print(data['ST_NUM'].isnull().sum())

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64
2

NaN is a standard missing value and so pandas recognizes it 

however, pandas doesnt recognize non-standard values:

In [9]:
print(data['NUM_BEDROOMS'])
print(data['NUM_BEDROOMS'].isnull().sum())

0      3
1      3
2    n/a
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object
1

^^ claims there's only one missing value when there are in fact three, so you can add these to the list when you're importing the dataset

In [15]:
url = "https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv"
missing = ["n/a", "na", "--"]
data = pd.read_csv(url, na_values = missing)
data

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

^^ now all the missing values are NaN, which means pandas will recognize them

In [16]:
print(data["NUM_BEDROOMS"])
print(data["NUM_BEDROOMS"].isnull().sum())

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64
3

the own_occupied has an unexpected value though - it's a string column but one entry is of type int (12)

so to fix this, we can loop through all the entries of the column and convert the integer values to NaN as follows:

In [17]:
count = 0

for o in data["OWN_OCCUPIED"]:
    try:
        int(o)
        data.loc[count, "OWN_OCCUPIED"] = np.nan
    except ValueError:
        pass
    count += 1

In [18]:
print(data["OWN_OCCUPIED"])
print(data["OWN_OCCUPIED"].isnull().sum())

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object
2

In [19]:
print(data.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        1
SQ_FT           2
dtype: int64

In [20]:
print(data.isnull().values.any())

True

In [21]:
print(data.isnull().sum().sum())

11

### replacing missing values

In [23]:
data["ST_NUM"].fillna(114, inplace = True)
data["ST_NUM"]

0    104.0
1    197.0
2    114.0
3    201.0
4    203.0
5    207.0
6    114.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [27]:
mean = data["ST_NUM"].mean()
data["ST_NUM"].fillna(mean, inplace = True)
data["ST_NUM"] #not showing because since we filled the NaN values with 114 first, there aren't any NaN values remaining to be filled

0    104.0
1    197.0
2    114.0
3    201.0
4    203.0
5    207.0
6    114.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [26]:
data["ST_NUM"].mean() #what the NaN values would've been replaced with

174.22222222222223